rf-eng/micropython/ports/esp32/modnetwork.c
    mp_obj_t list = mp_obj_new_list(0, NULL);
    wifi_scan_config_t config = { 0 };
    // XXX how do we scan hidden APs (and if we can scan them, are they really hidden?)
    MP_THREAD_GIL_EXIT();
    esp_err_t status = esp_wifi_scan_start(&config, 1);
    MP_THREAD_GIL_ENTER();
    if (status == 0) {
        uint16_t count = 0;
        ESP_EXCEPTIONS(esp_wifi_scan_get_ap_num(&count));
        wifi_ap_record_t *wifi_ap_records = calloc(count, sizeof(wifi_ap_record_t));
        ESP_EXCEPTIONS(esp_wifi_scan_get_ap_records(&count, wifi_ap_records));
        for (uint16_t i = 0; i < count; i++) {
            mp_obj_tuple_t *t = mp_obj_new_tuple(6, NULL);
            uint8_t *x = memchr(wifi_ap_records[i].ssid, 0, sizeof(wifi_ap_records[i].ssid));
            int ssid_len = x ? x - wifi_ap_records[i].ssid : sizeof(wifi_ap_records[i].ssid);
            t->items[0] = mp_obj_new_bytes(wifi_ap_records[i].ssid, ssid_len);
            t->items[1] = mp_obj_new_bytes(wifi_ap_records[i].bssid, sizeof(wifi_ap_records[i].bssid));
            t->items[2] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].primary);
            t->items[3] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].rssi);
            t->items[4] = MP_OBJ_NEW_SMALL_INT(wifi_ap_records[i].authmode);
            t->items[5] = mp_const_false; // XXX hidden?
            mp_obj_list_append(list, MP_OBJ_FROM_PTR(t));
        }
        free(wifi_ap_records);
    }
    return list;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_1(esp_scan_obj, esp_scan);

STATIC mp_obj_t *esp_monitor_list = NULL;
STATIC mp_obj_t esp_monitor_mac_filter;
STATIC byte *esp_monitor_buf;
STATIC size_t esp_monitor_buf_len;
STATIC bool new_callback = false;

IRAM_ATTR static void esp_monitor_cb(void *result, wifi_promiscuous_pkt_type_t type)
{ //IRAM faster?
    //mp_printf(&mp_plat_print, "in callback\n");
    wifi_promiscuous_pkt_t *monitor = (wifi_promiscuous_pkt_t *)result;
    if (esp_monitor_list == NULL)
    {
        return;
    }
    // mp_printf(&mp_plat_print, "payload len: %d\n", monitor->rx_ctrl.sig_len);
    // mp_printf(&mp_plat_print, "rssi: %d\n", monitor->rx_ctrl.rssi);
    // mp_printf(&mp_plat_print, "type: %d\n", type);
    if (monitor->rx_ctrl.sig_len > 0)
    {
        esp_monitor_buf = malloc(monitor->rx_ctrl.sig_len);
        memcpy(esp_monitor_buf, monitor->payload, monitor->rx_ctrl.sig_len);
        esp_monitor_buf_len = monitor->rx_ctrl.sig_len;
        new_callback = true;
    }
}

STATIC mp_obj_t esp_monitor(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
{
    require_if(pos_args[0], WIFI_IF_STA);
    // check that STA mode is active
    wifi_mode_t mode;
    ESP_EXCEPTIONS(esp_wifi_get_mode(&mode));
    if ((mode & WIFI_MODE_STA) == 0)
    {
        mp_raise_msg(&mp_type_OSError, MP_ERROR_TEXT("STA must be active"));
    }

    enum
    {
        ARG_mac,
        ARG_ch,
        ARG_timeout
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_mac, MP_ARG_OBJ, {.u_obj = mp_const_empty_bytes}},
        {MP_QSTR_ch, MP_ARG_INT, {.u_int = 1}},
        {MP_QSTR_timeout, MP_ARG_INT, {.u_int = 1}},
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (MP_OBJ_IS_STR_OR_BYTES(args[ARG_mac].u_obj))
    {
        esp_monitor_mac_filter = args[ARG_mac].u_obj;
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_TypeError,
                                           "invalid mac type"));
    }

    uint32_t ch = args[ARG_ch].u_int;
    uint32_t timeout_us = args[ARG_timeout].u_int * 1000000;
    timeout_us = timeout_us > 1000000 ? timeout_us : 1000000;

    mp_obj_t list = mp_obj_new_list(0, NULL);
    esp_monitor_list = &list;

    //Disconnect all connections
    //esp_wifi_disconnect();
    //esp_wifi_set_promiscuous_filter(&wifi_filter);
    //Register the callback function
    esp_wifi_set_promiscuous_rx_cb(esp_monitor_cb);
    //Set the mac address to filter
    /*if (args[ARG_mac].u_obj != mp_const_none){
        const char *mac = mp_obj_str_get_str(esp_monitor_mac_filter);
        wifi_promiscuous_set_mac((const uint8_t *)mac);
    }*/
    esp_wifi_set_promiscuous(true); //wifi_promiscuous_enable(1);
    //Set the channel
    esp_wifi_set_channel(ch, WIFI_SECOND_CHAN_NONE);
    struct timeval tv_now;
    gettimeofday(&tv_now, NULL);
    int64_t start_time_us = (int64_t)tv_now.tv_sec * 1000000L + (int64_t)tv_now.tv_usec;
    while (esp_monitor_list != NULL)
    {
        if (MP_STATE_VM(mp_pending_exception) != NULL)
        {
            esp_monitor_list = NULL;
            mp_obj_t obj = MP_STATE_VM(mp_pending_exception);
            MP_STATE_VM(mp_pending_exception) = MP_OBJ_NULL;
            nlr_raise(obj);
        }
        gettimeofday(&tv_now, NULL);
        int64_t cur_time_us = (int64_t)tv_now.tv_sec * 1000000L + (int64_t)tv_now.tv_usec;
        if (cur_time_us - start_time_us >= timeout_us)
        {
            esp_monitor_list = NULL;
        }
        if (new_callback)
        {
            new_callback = false;
            nlr_buf_t nlr;
            if (nlr_push(&nlr) == 0)
            {
                //mp_printf(&mp_plat_print, "create new byte array\n");
                mp_obj_list_append(*esp_monitor_list,
                                   mp_obj_new_bytearray(esp_monitor_buf_len, MP_OBJ_FROM_PTR(esp_monitor_buf)));
                free(esp_monitor_buf);
                nlr_pop();
            }
            else
            {
                mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
            }
        }
    }
    if (list == MP_OBJ_NULL)
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "monitor failed"));
    }
    esp_wifi_set_promiscuous(false); //wifi_promiscuous_enable(0);
    return list;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(esp_monitor_obj, 1, esp_monitor);

STATIC mp_obj_t esp_raw_80211_tx(mp_obj_t self_in, mp_obj_t buf_in)
{
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(self_in);

    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(buf_in, &bufinfo, MP_BUFFER_READ);

    esp_wifi_80211_tx(self->if_id, bufinfo.buf, bufinfo.len, false);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(esp_raw_80211_tx_obj, esp_raw_80211_tx);

STATIC mp_obj_t esp_isconnected(mp_obj_t self_in) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->if_id == WIFI_IF_STA) {
        return mp_obj_new_bool(wifi_sta_connected);
    } else {
        wifi_sta_list_t sta;
        esp_wifi_ap_get_sta_list(&sta);
        return mp_obj_new_bool(sta.num != 0);
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(esp_isconnected_obj, esp_isconnected);

STATIC mp_obj_t esp_ifconfig(size_t n_args, const mp_obj_t *args) {
    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);
    tcpip_adapter_ip_info_t info;
    tcpip_adapter_dns_info_t dns_info;
    tcpip_adapter_get_ip_info(self->if_id, &info);
    tcpip_adapter_get_dns_info(self->if_id, DNS_MAIN, &dns_info);
    if (n_args == 1) {
        // get
        mp_obj_t tuple[4] = {
            netutils_format_ipv4_addr((uint8_t *)&info.ip, NETUTILS_BIG),
            netutils_format_ipv4_addr((uint8_t *)&info.netmask, NETUTILS_BIG),
            netutils_format_ipv4_addr((uint8_t *)&info.gw, NETUTILS_BIG),
            netutils_format_ipv4_addr((uint8_t *)&dns_info.ip, NETUTILS_BIG),
        };
        return mp_obj_new_tuple(4, tuple);
    } else {
        // set
        if (mp_obj_is_type(args[1], &mp_type_tuple) || mp_obj_is_type(args[1], &mp_type_list)) {
            mp_obj_t *items;
            mp_obj_get_array_fixed_n(args[1], 4, &items);
            netutils_parse_ipv4_addr(items[0], (void *)&info.ip, NETUTILS_BIG);
            if (mp_obj_is_integer(items[1])) {
                // allow numeric netmask, i.e.:
                // 24 -> 255.255.255.0
                // 16 -> 255.255.0.0
                // etc...
                uint32_t *m = (uint32_t *)&info.netmask;
                *m = htonl(0xffffffff << (32 - mp_obj_get_int(items[1])));
            } else {
                netutils_parse_ipv4_addr(items[1], (void *)&info.netmask, NETUTILS_BIG);
            }
            netutils_parse_ipv4_addr(items[2], (void *)&info.gw, NETUTILS_BIG);
            netutils_parse_ipv4_addr(items[3], (void *)&dns_info.ip, NETUTILS_BIG);
            // To set a static IP we have to disable DHCP first
            if (self->if_id == WIFI_IF_STA || self->if_id == ESP_IF_ETH) {
                esp_err_t e = tcpip_adapter_dhcpc_stop(self->if_id);
                if (e != ESP_OK && e != ESP_ERR_TCPIP_ADAPTER_DHCP_ALREADY_STOPPED) {
                    _esp_exceptions(e);
                }
                ESP_EXCEPTIONS(tcpip_adapter_set_ip_info(self->if_id, &info));
                ESP_EXCEPTIONS(tcpip_adapter_set_dns_info(self->if_id, DNS_MAIN, &dns_info));
            } else if (self->if_id == WIFI_IF_AP) {
                esp_err_t e = tcpip_adapter_dhcps_stop(WIFI_IF_AP);
                if (e != ESP_OK && e != ESP_ERR_TCPIP_ADAPTER_DHCP_ALREADY_STOPPED) {
                    _esp_exceptions(e);
                }
                ESP_EXCEPTIONS(tcpip_adapter_set_ip_info(WIFI_IF_AP, &info));
                ESP_EXCEPTIONS(tcpip_adapter_set_dns_info(WIFI_IF_AP, DNS_MAIN, &dns_info));
                ESP_EXCEPTIONS(tcpip_adapter_dhcps_start(WIFI_IF_AP));
            }
        } else {
            // check for the correct string
            const char *mode = mp_obj_str_get_str(args[1]);
            if ((self->if_id != WIFI_IF_STA && self->if_id != ESP_IF_ETH) || strcmp("dhcp", mode)) {
                mp_raise_ValueError(MP_ERROR_TEXT("invalid arguments"));
            }
            ESP_EXCEPTIONS(tcpip_adapter_dhcpc_start(self->if_id));
        }
        return mp_const_none;
    }
}

MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(esp_ifconfig_obj, 1, 2, esp_ifconfig);

STATIC mp_obj_t esp_config(size_t n_args, const mp_obj_t *args, mp_map_t *kwargs) {
    if (n_args != 1 && kwargs->used != 0) {
        mp_raise_TypeError(MP_ERROR_TEXT("either pos or kw args are allowed"));
    }

    wlan_if_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    bool is_wifi = self->if_id == WIFI_IF_AP || self->if_id == WIFI_IF_STA;

    wifi_config_t cfg;
    if (is_wifi) {
        ESP_EXCEPTIONS(esp_wifi_get_config(self->if_id, &cfg));
    }

    #define QS(x) (uintptr_t)MP_OBJ_NEW_QSTR(x)

